{
  "ayahs": [
    {
      "id": "2:261",
      "surah": "Al-Baqarah",
      "verse": "2:261",
      "arabic": "مَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنۡۢبَتَتۡ سَبۡعَ سَنَابِلَ فِىۡ كُلِّ سُنۡۢبُلَةٍ مِّائَةُ حَبَّةٍ​ؕ وَاللّٰهُ يُضٰعِفُ لِمَنۡ يَّشَآءُ​ ؕ وَاللّٰهُ وَاسِعٌ عَلِيۡمٌ",
      "translation": {
        "en": "The example of those who spend their wealth in the cause of Allah is that of a grain that sprouts into seven ears, each bearing one hundred grains. And Allah multiplies ˹the reward even more˺ to whoever He wills. For Allah is All-Bountiful, All-Knowing.",
        "tr": "Allah yolunda mallarını harcayanların örneği, yedi başak bitiren bir dane gibidir ki, her başakta yüz dane vardır. Allah dilediğine kat kat fazlasını verir. Allah, lütfu geniş olan ve herşeyi hakkıyla bilendir."
      }
    },
    {
      "id": "2:262",
      "surah": "Al-Baqarah",
      "verse": "2:262",
      "arabic": "اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ فِىۡ سَبِيۡلِ اللّٰهِ ثُمَّ لَا يُتۡبِعُوۡنَ مَاۤ اَنۡفَقُوۡا مَنًّا وَّلَاۤ اَذًى​ۙ لَّهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
      "translation": {
        "en": "Those who spend their wealth in the cause of Allah and do not follow their charity with reminders of their generosity or hurtful words—they will get their reward from their Lord, and there will be no fear for them, nor will they grieve.",
        "tr": "Mallarını Allah yolunda harcayıp da arkasından başa kakmayan, fakirlerin gönlünü kırmayan kimseler var ya, onların Allah katında (has) mükâfatları vardır. Onlar için korku yoktur, üzüntü de çekmeyeceklerdir."
      }
    },
    {
      "id": "2:263",
      "surah": "Al-Baqarah",
      "verse": "2:263",
      "arabic": "قَوۡلٌ مَّعۡرُوۡفٌ وَّمَغۡفِرَةٌ خَيۡرٌ مِّنۡ صَدَقَةٍ يَّتۡبَعُهَاۤ اَذًى​ؕ وَاللّٰهُ غَنِىٌّ حَلِيۡمٌ",
      "translation": {
        "en": "Kind words and forgiveness are better than charity followed by injury. And Allah is Self-Sufficient, Most Forbearing.",
        "tr": "Güzel söz ve bağışlama, arkasından incitme gelen sadakadan daha iyidir. Allah, zengindir (kullarının verecekleri sadakadan müstağnidir), Halîm'dir."
      }
    },
    {
      "id": "2:264",
      "surah": "Al-Baqarah",
      "verse": "2:264",
      "arabic": "يٰۤـاَيُّهَا الَّذِيۡنَ اٰمَنُوۡا لَا تُبۡطِلُوۡا صَدَقٰتِكُمۡ بِالۡمَنِّ وَالۡاَذٰىۙ كَالَّذِىۡ يُنۡفِقُ مَالَهٗ رِئَآءَ النَّاسِ وَلَا يُؤۡمِنُ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ​ؕ فَمَثَلُهٗ كَمَثَلِ صَفۡوَانٍ عَلَيۡهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلۡدًا ​ؕ لَا يَقۡدِرُوۡنَ عَلٰى شَىۡءٍ مِّمَّا كَسَبُوۡا ​ؕ وَاللّٰهُ لَا يَهۡدِى الۡقَوۡمَ الۡـكٰفِرِيۡنَ",
      "translation": {
        "en": "O believers! Do not waste your charity with reminders ˹of your generosity˺ or hurtful words, like those who donate their wealth just to show off and do not believe in Allah or the Last Day. Their example is that of a hard barren rock covered with a thin layer of soil hit by a strong rain—leaving it just a bare stone. Such people are unable to preserve the reward of their charity. Allah does not guide ˹such˺ disbelieving people.",
        "tr": "Ey iman edenler! Allah’a ve ahiret gününe inanmadığı halde malını gösteriş için harcayan kimse gibi, başa kakmak ve incitmek suretiyle, yaptığınız hayırlarınızı boşa çıkarmayın. Böylesinin (gösteriş için sadaka verenin) durumu, üzerinde biraz toprak bulunan bir kayaya benzer ki, sağanak bir yağmur isabet etmiş de onu çıplak bir kaya haline getirivermiştir. Bunlar kazandıklarından hiçbir şeye sahip olamazlar. Allah, kâfirleri doğru yola iletmez."
      }
    },
    {
      "id": "2:265",
      "surah": "Al-Baqarah",
      "verse": "2:265",
      "arabic": "وَمَثَلُ الَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمُ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ وَ تَثۡبِيۡتًا مِّنۡ اَنۡفُسِهِمۡ كَمَثَلِ جَنَّةٍۢ بِرَبۡوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتۡ اُكُلَهَا ضِعۡفَيۡنِ​ۚ فَاِنۡ لَّمۡ يُصِبۡهَا وَابِلٌ فَطَلٌّ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ بَصِيۡرٌ",
      "translation": {
        "en": "And the example of those who donate their wealth, seeking Allah’s pleasure and believing the reward is certain,1 is that of a garden on a fertile hill: when heavy rain falls, it yields up twice its normal produce. If no heavy rain falls, a drizzle is sufficient. And Allah is All-Seeing of what you do.",
        "tr": "Allah'ın rızasını kazanmak ve ruhlarındaki cömertliği kuvvetlendirmek için mallarını hayra sarfedenlerin durumu, bir tepede kurulmuş güzel bir bahçeye benzer ki, üzerine bol yağmur yağmış da iki kat ürün vermiştir. Bol yağmur yağmasa bile bir çisinti düşer (de yine ürün verir). Allah, yaptıklarınızı hakkıyla görendir."
      }
    },
    {
      "id": "2:270",
      "surah": "Al-Baqarah",
      "verse": "2:270",
      "arabic": "وَمَاۤ اَنۡفَقۡتُمۡ مِّنۡ نَّفَقَةٍ اَوۡ نَذَرۡتُمۡ مِّنۡ نَّذۡرٍ فَاِنَّ اللّٰهَ يَعۡلَمُهٗ ؕ وَمَا لِلظّٰلِمِيۡنَ مِنۡ اَنۡصَارٍ",
      "translation": {
        "en": "Whatever charities you give or vows you make are surely known to Allah. And the wrongdoers will have no helpers.",
        "tr": "Yaptığınız her harcamayı ve adadığınız her adağı muhakkak Allah bilir. Zalimler için hiç yardımcı yoktur."
      }
    },
    {
      "id": "2:271",
      "surah": "Al-Baqarah",
      "verse": "2:271",
      "arabic": "اِنۡ تُبۡدُوا الصَّدَقٰتِ فَنِعِمَّا هِىَ​ۚ وَاِنۡ تُخۡفُوۡهَا وَ تُؤۡتُوۡهَا الۡفُقَرَآءَ فَهُوَ خَيۡرٌ لَّكُمۡ​ؕ وَيُكَفِّرُ عَنۡكُمۡ مِّنۡ سَيِّاٰتِكُمۡ​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ",
      "translation": {
        "en": "To give charity publicly is good, but to give to the poor privately is better for you, and will absolve you of your sins. And Allah is All-Aware of what you do.",
        "tr": "Eğer sadakaları (zekât ve benzeri hayırları) açıktan verirseniz iyidir. Eğer onu fakirlere gizlice verirseniz, işte bu sizin için daha hayırlıdır. Allah da bu sebeple sizin günahlarınızdan bir kısmını örter. Allah, yaptıklarınızdan hakkıyla haberdardır."
      }
    },
    {
      "id": "2:272",
      "surah": "Al-Baqarah",
      "verse": "2:272",
      "arabic": "۞ لَيۡسَ عَلَيۡكَ هُدٰٮهُمۡ وَلٰـكِنَّ اللّٰهَ يَهۡدِىۡ مَنۡ يَّشَآءُ​ ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَلِاَنۡفُسِكُمۡ​ؕ وَمَا تُنۡفِقُوۡنَ اِلَّا ابۡتِغَآءَ وَجۡهِ اللّٰهِ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ يُّوَفَّ اِلَيۡكُمۡ وَاَنۡـتُمۡ لَا تُظۡلَمُوۡنَ",
      "translation": {
        "en": "You are not responsible for people’s guidance ˹O Prophet˺—it is Allah Who guides whoever He wills. Whatever you ˹believers˺ spend in charity, it is for your own good—as long as you do so seeking the pleasure of Allah. Whatever you donate will be paid back to you in full, and you will not be wronged.",
        "tr": "(Ey Muhammed!) Onları hidâyete erdirmek (doğru yola iletmek) sana ait değildir. Lâkin Allah dilediğini doğru yola iletir. Hayır olarak harcadıklarınız kendi iyiliğiniz içindir. Yapacağınız hayırları ancak Allah'ın rızasını kazanmak için yapmalısınız. Hayır olarak verdiğiniz ne varsa, karşılığı size tam olarak verilir ve asla haksızlığa uğratılmazsınız."
      }
    },
    {
      "id": "2:273",
      "surah": "Al-Baqarah",
      "verse": "2:273",
      "arabic": "لِلۡفُقَرَآءِ الَّذِيۡنَ اُحۡصِرُوۡا فِىۡ سَبِيۡلِ اللّٰهِ لَا يَسۡتَطِيۡعُوۡنَ ضَرۡبًا فِى الۡاَرۡضِ يَحۡسَبُهُمُ الۡجَاهِلُ اَغۡنِيَآءَ مِنَ التَّعَفُّفِ​ۚ تَعۡرِفُهُمۡ بِسِيۡمٰهُمۡ​ۚ لَا يَسۡـــَٔلُوۡنَ النَّاسَ اِلۡحَــافًا ​ؕ وَمَا تُنۡفِقُوۡا مِنۡ خَيۡرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ",
      "translation": {
        "en": "˹Charity is˺ for the needy who are too engaged in the cause of Allah to move about in the land ˹for work˺. Those unfamiliar with their situation will think they are not in need ˹of charity˺ because they do not beg. You can recognize them by their appearance. They do not beg people persistently. Whatever you give in charity is certainly well known to Allah.",
        "tr": "(Yapacağınız hayırlar,) kendilerini Allah yoluna adamış, bu sebeple yeryüzünde kazanç için dolaşamayan fakirler için olsun. Bilmeyen kimseler, iffetlerinden dolayı onları zengin zanneder. Sen onları simalarından tanırsın. Çünkü onlar yüzsüzlük ederek istemezler. Sadaka olarak verdiğiniz her şeyi, Allah, hakkıyla bilendir."
      }
    },
    {
      "id": "2:274",
      "surah": "Al-Baqarah",
      "verse": "2:274",
      "arabic": "اَلَّذِيۡنَ يُنۡفِقُوۡنَ اَمۡوَالَهُمۡ بِالَّيۡلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمۡ اَجۡرُهُمۡ عِنۡدَ رَبِّهِمۡ​ۚ وَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُوۡنَ",
      "translation": {
        "en": "Those who spend their wealth in charity day and night, secretly and openly—their reward is with their Lord, and there will be no fear for them, nor will they grieve.",
        "tr": "Mallarını gece ve gündüz, gizli ve açık hayra sarfedenler var ya, onların mükâfatları Allah katındadır. Onlara korku yoktur, üzüntü de çekmezler."
      }
    },
    {
      "id": "2:276",
      "surah": "Al-Baqarah",
      "verse": "2:276",
      "arabic": "يَمۡحَقُ اللّٰهُ الرِّبٰوا وَيُرۡبِى الصَّدَقٰتِ​ؕ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيۡمٍ",
      "translation": {
        "en": "Allah has made interest fruitless and charity fruitful. And Allah does not like any ungrateful evildoer.",
        "tr": "Allah faizi tüketir (Faiz karışan malın bereketini giderir), sadakaları ise bereketlendirir. Allah küfürde ve günahta ısrar eden hiç kimseyi sevmez."
      }
    },
    {
      "id": "2:280",
      "surah": "Al-Baqarah",
      "verse": "2:280",
      "arabic": "وَاِنۡ كَانَ ذُوۡ عُسۡرَةٍ فَنَظِرَةٌ اِلٰى مَيۡسَرَةٍ ​ؕ وَاَنۡ تَصَدَّقُوۡا خَيۡرٌ لَّـكُمۡ​ اِنۡ كُنۡتُمۡ تَعۡلَمُوۡنَ",
      "translation": {
        "en": "If it is difficult for someone to repay a debt, postpone it until a time of ease. And if you waive it as an act of charity, it will be better for you, if only you knew.",
        "tr": "Eğer (borçlu) darlık içinde ise, eli genişleyinceye kadar ona mühlet vermek (gerekir). Halbuki bilmiş olsanız, (alacağınızı) sadaka olarak bağışlamanız, sizin için daha hayırlıdır."
      }
    },
    {
      "id": "3:92",
      "surah": "Aal-E-Imran",
      "verse": "3:92",
      "arabic": "لَنۡ تَنَالُوا الۡبِرَّ حَتّٰى تُنۡفِقُوۡا مِمَّا تُحِبُّوۡنَ ؕ  وَمَا تُنۡفِقُوۡا مِنۡ شَىۡءٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيۡمٌ",
      "translation": {
        "en": "You will never achieve righteousness until you donate some of what you cherish. And whatever you give is certainly well known to Allah.",
        "tr": "Sevdiğiniz şeylerden (Allah yolunda) harcamadıkça iyiye eremezsiniz. Her ne harcarsanız, Allah onu hakkıyla bilir."
      }
    },
    {
      "id": "4:114",
      "surah": "An-Nisa",
      "verse": "4:114",
      "arabic": "۞ لَا خَيۡرَ فِىۡ كَثِيۡرٍ مِّنۡ نَّجۡوٰٮهُمۡ اِلَّا مَنۡ اَمَرَ بِصَدَقَةٍ اَوۡ مَعۡرُوۡفٍ اَوۡ اِصۡلَاحٍۢ بَيۡنَ النَّاسِ​ ؕ وَمَن يَّفۡعَلۡ ذٰ لِكَ ابۡتِغَآءَ مَرۡضَاتِ اللّٰهِ فَسَوۡفَ نُـؤۡتِيۡهِ اَجۡرًا عَظِيۡمًا",
      "translation": {
        "en": "There is no good in most of their secret talks—except those encouraging charity, kindness, or reconciliation between people. And whoever does this seeking Allah’s pleasure, We will grant them a great reward.",
        "tr": "Bir sadakayı, yahut bir iyiliği, yahut ta insanlar arasını düzeltmeyi emredenlerinki dışında, gizli gizli konuşup fısıldaşmalarının çoğunda hayır yoktur. Her kim bunu sırf Allah'ın rızasını kazanmak maksadıyla yaparsa, ona büyük mükâfat vereceğiz."
      }
    },
    {
      "id": "5:12",
      "surah": "Al-Ma'idah",
      "verse": "5:12",
      "arabic": "۞ وَلَقَدۡ اَخَذَ اللّٰهُ مِيۡثَاقَ بَنِىۡۤ اِسۡرآءِيۡلَ​ۚ وَبَعَثۡنَا مِنۡهُمُ اثۡنَىۡ عَشَرَ نَقِيۡبًا​ ؕ وَقَالَ اللّٰهُ اِنِّىۡ مَعَكُمۡ​ؕ لَٮِٕنۡ اَقَمۡتُمُ الصَّلٰوةَ وَاٰتَيۡتُمُ الزَّكٰوةَ وَاٰمَنۡتُمۡ بِرُسُلِىۡ وَعَزَّرۡتُمُوۡهُمۡ وَاَقۡرَضۡتُمُ اللّٰهَ قَرۡضًا حَسَنًا لَّاُكَفِّرَنَّ عَنۡكُمۡ سَيِّاٰتِكُمۡ وَلَاُدۡخِلَـنَّكُمۡ جَنّٰتٍ تَجۡرِىۡ مِنۡ تَحۡتِهَا الۡاَنۡهٰرُ​ۚ فَمَنۡ كَفَرَ بَعۡدَ ذٰ لِكَ مِنۡكُمۡ فَقَدۡ ضَلَّ سَوَآءَ السَّبِيۡلِ",
      "translation": {
        "en": "Allah made a covenant with the Children of Israel and appointed twelve leaders from among them and ˹then˺ said, “I am truly with you. If you establish prayer, pay alms-tax, believe in My messengers, support them, and lend to Allah a good loan, I will certainly forgive your sins and admit you into Gardens under which rivers flow. And whoever among you disbelieves afterwards has truly strayed from the Right Way.”",
        "tr": "Andolsun ki Allah, İsrailoğullarından söz almıştı. (Kefil olarak) içlerinden on iki de başkan göndermiştik. Allah onlara şöyle demişti: Ben sizinle beraberim. Eğer namazı dosdoğru kılar, zekâtı verir, peygamberlerime inanır, onları destekler ve (malınızı) Allah yolunda güzelce sarfederseniz, andolsun ki sizin günahlarınızı örterim ve sizi, altlarından ırmaklar akan cennetlere sokarım. Bundan sonra sizden kim inkâr yolunu tutarsa doğru yoldan sapmış olur."
      }
    },
    {
      "id": "5:55",
      "surah": "Al-Ma'idah",
      "verse": "5:55",
      "arabic": "اِنَّمَا وَلِيُّكُمُ اللّٰهُ وَرَسُوۡلُهٗ وَالَّذِيۡنَ اٰمَنُوا الَّذِيۡنَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَيُؤۡتُوۡنَ الزَّكٰوةَ وَهُمۡ رَاكِعُوۡنَ",
      "translation": {
        "en": "Your only guardians are Allah, His Messenger, and fellow believers—who establish prayer and pay alms-tax with humility.",
        "tr": "Sizin asıl dostunuz (veliniz) ancak Allah'tır, Rasûlüdür, iman edenlerdir. Onlar ki Allah'ın emirlerine boyun eğerek namazı dosdoğru kılar, zekâtı verirler."
      }
    },
    {
      "id": "9:18",
      "surah": "At-Tawbah",
      "verse": "9:18",
      "arabic": "اِنَّمَا يَعۡمُرُ مَسٰجِدَ اللّٰهِ مَنۡ اٰمَنَ بِاللّٰهِ وَالۡيَوۡمِ الۡاٰخِرِ وَاَ قَامَ الصَّلٰوةَ وَاٰتَى الزَّكٰوةَ وَلَمۡ يَخۡشَ اِلَّا اللّٰهَ​ فَعَسٰٓى اُولٰۤٮِٕكَ اَنۡ يَّكُوۡنُوۡا مِنَ الۡمُهۡتَدِيۡنَ",
      "translation": {
        "en": "The mosques of Allah should only be maintained by those who believe in Allah and the Last Day, establish prayer, pay alms-tax, and fear none but Allah. It is right to hope that they will be among the ˹truly˺ guided.",
        "tr": "Allah'ın mescitlerini ancak Allah'a ve ahiret gününe iman eden, namazı dosdoğru kılan, zekâtı veren ve Allah’tan başkasından korkmayan kimseler imar eder. İşte doğru yola ermişlerden olmaları umulanlar bunlardır."
      }
    },
    {
      "id": "9:60",
      "surah": "At-Tawbah",
      "verse": "9:60",
      "arabic": "۞ اِنَّمَا الصَّدَقٰتُ لِلۡفُقَرَآءِ وَالۡمَسٰكِيۡنِ وَالۡعٰمِلِيۡنَ عَلَيۡهَا وَالۡمُؤَلَّـفَةِ قُلُوۡبُهُمۡ وَفِى الرِّقَابِ وَالۡغٰرِمِيۡنَ وَفِىۡ سَبِيۡلِ اللّٰهِ وَابۡنِ السَّبِيۡلِ​ؕ فَرِيۡضَةً مِّنَ اللّٰهِ​ؕ وَاللّٰهُ عَلِيۡمٌ حَكِيۡمٌ",
      "translation": {
        "en": "Alms-tax is only for the poor and the needy, for those employed to administer it, for those whose hearts are attracted ˹to the faith˺, for ˹freeing˺ slaves, for those in debt, for Allah’s cause, and for ˹needy˺ travellers. ˹This is˺ an obligation from Allah. And Allah is All-Knowing, All-Wise.",
        "tr": "Sadakalar (zekâtlar) Allah’tan bir farz olarak ancak, yoksullara, düşkünlere, (zekât toplayan) memurlara, gönülleri (İslâm'a) ısındırılacak olanlara, (hürriyetlerini satın almaya çalışan) kölelere, borçlulara, Allah yolunda çalışıp cihad edenlere, yolcuya mahsustur. Allah pek iyi bilendir, hikmet sahibidir."
      }
    },
    {
      "id": "9:103",
      "surah": "At-Tawbah",
      "verse": "9:103",
      "arabic": "خُذۡ مِنۡ اَمۡوَالِهِمۡ صَدَقَةً تُطَهِّرُهُمۡ وَتُزَكِّيۡهِمۡ بِهَا وَصَلِّ عَلَيۡهِمۡ​ؕ اِنَّ صَلٰوتَكَ سَكَنٌ لَّهُمۡ​ؕ وَاللّٰهُ سَمِيۡعٌ عَلِيۡمٌ",
      "translation": {
        "en": "Take from their wealth ˹O Prophet˺ charity to purify and bless them, and pray for them—surely your prayer is a source of comfort for them. And Allah is All-Hearing, All-Knowing.",
        "tr": "Onların mallarından sadaka al; bununla onları (günahlardan) temizlersin, onları arıtıp yüceltirsin. Ve onlar için dua et. Çünkü senin duan onlar için sükûnettir (onları yatıştırır). Allah hakkkıyla işitendir, hakkıyla bilendir."
      }
    },
    {
      "id": "9:104",
      "surah": "At-Tawbah",
      "verse": "9:104",
      "arabic": "اَلَمۡ يَعۡلَمُوۡۤا اَنَّ اللّٰهَ هُوَ يَقۡبَلُ التَّوۡبَةَ عَنۡ عِبَادِهٖ وَيَاۡخُذُ الصَّدَقٰتِ وَ اَنَّ اللّٰهَ هُوَ التَّوَّابُ الرَّحِيۡمُ",
      "translation": {
        "en": "Do they not know that Allah alone accepts the repentance of His servants and receives ˹their˺ charity, and that Allah alone is the Accepter of Repentance, Most Merciful?",
        "tr": "Allah'ın, kullarının tevbesini kabul edeceğini, sadakaları geri çevirmeyeceğini ve Allah'ın tevbeyi çok kabul eden ve pek esirgeyen olduğunu hâla bilmezler mi?"
      }
    },
    {
      "id": "19:31",
      "surah": "Maryam",
      "verse": "19:31",
      "arabic": "وَّجَعَلَنِىۡ مُبٰـرَكًا اَيۡنَ مَا كُنۡتُ وَاَوۡصٰنِىۡ بِالصَّلٰوةِ وَالزَّكٰوةِ مَا دُمۡتُ حَيًّا ​ۖ ",
      "translation": {
        "en": "He has made me a blessing wherever I go, and bid me to establish prayer and give alms-tax as long as I live,",
        "tr": "«Nerede olursam olayım, O beni mübarek kıldı; yaşadığım sürece bana namazı ve zekâtı emretti.»"
      }
    },
    {
      "id": "21:73",
      "surah": "Al-Anbiya",
      "verse": "21:73",
      "arabic": "وَجَعَلۡنٰهُمۡ اَٮِٕمَّةً يَّهۡدُوۡنَ بِاَمۡرِنَا وَاَوۡحَيۡنَاۤ اِلَيۡهِمۡ فِعۡلَ الۡخَيۡرٰتِ وَاِقَامَ الصَّلٰوةِ وَاِيۡتَآءَ الزَّكٰوةِ​ۚ وَكَانُوۡا لَـنَا عٰبِدِيۡنَ",
      "translation": {
        "en": "We ˹also˺ made them leaders, guiding by Our command, and inspired them to do good deeds, establish prayer, and pay alms-tax. And they were devoted to Our worship.",
        "tr": "Onları, emrimiz uyarınca doğru yolu gösteren önderler yaptık ve kendilerine hayırlı işler yapmayı, namaz kılmayı, zekât vermeyi vahyettik. Onlar, daima bize ibadet eden kimselerdi."
      }
    },
    {
      "id": "22:35",
      "surah": "Al-Hajj",
      "verse": "22:35",
      "arabic": "الَّذِيۡنَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتۡ قُلُوۡبُهُمۡ وَالصّٰبِرِيۡنَ عَلٰى مَاۤ اَصَابَهُمۡ وَالۡمُقِيۡمِى الصَّلٰوةِ ۙ وَمِمَّا رَزَقۡنٰهُمۡ يُنۡفِقُوۡنَ",
      "translation": {
        "en": "Those whose hearts tremble at the remembrance of Allah, who patiently endure whatever may befall them, and who establish prayer and donate from what We have provided for them.",
        "tr": "Onlar öyle kimseler ki, Allah anıldığı zaman kalpleri titrer; başlarına gelene sabrederler, namazı dosdoğru kılarlar ve kendilerine rızık olarak verdiğimiz şeylerden (Allah için) infâk ederler."
      }
    },
    {
      "id": "22:41",
      "surah": "Al-Hajj",
      "verse": "22:41",
      "arabic": "اَ لَّذِيۡنَ اِنۡ مَّكَّنّٰهُمۡ فِى الۡاَرۡضِ اَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ وَاَمَرُوۡا بِالۡمَعۡرُوۡفِ وَنَهَوۡا عَنِ الۡمُنۡكَرِ​ ؕ وَلِلّٰهِ عَاقِبَةُ الۡاُمُوۡرِ",
      "translation": {
        "en": "˹They are˺ those who, if established in the land by Us, would perform prayer, pay alms-tax, encourage what is good, and forbid what is evil. And with Allah rests the outcome of all affairs.",
        "tr": "Onlar (o müminler) ki, eğer kendilerine yeryüzünde iktidar verirsek namazı dosdoğru kılarlar, zekâtı verirler, iyiliği emreder ve kötülükten nehyederler. İşlerin sonu Allah'a varır."
      }
    },
    {
      "id": "22:78",
      "surah": "Al-Hajj",
      "verse": "22:78",
      "arabic": "وَجَاهِدُوۡا فِى اللّٰهِ حَقَّ جِهَادِهٖ​ؕ هُوَ اجۡتَبٰٮكُمۡ وَمَا جَعَلَ عَلَيۡكُمۡ فِى الدِّيۡنِ مِنۡ حَرَجٍ​ؕ مِلَّةَ اَبِيۡكُمۡ اِبۡرٰهِيۡمَ​ؕ هُوَ سَمّٰٮكُمُ الۡمُسۡلِمِيۡنَ ۙ مِنۡ قَبۡلُ وَفِىۡ هٰذَا لِيَكُوۡنَ الرَّسُوۡلُ شَهِيۡدًا عَلَيۡكُمۡ وَتَكُوۡنُوۡا شُهَدَآءَ عَلَى النَّاسِ​ ​ۖۚ فَاَقِيۡمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاعۡتَصِمُوۡا بِاللّٰهِؕ هُوَ مَوۡلٰٮكُمۡ​ۚ فَنِعۡمَ الۡمَوۡلٰى وَنِعۡمَ النَّصِيۡرُ",
      "translation": {
        "en": "Strive for ˹the cause of˺ Allah in the way He deserves, for ˹it is˺ He ˹Who˺ has chosen you, and laid upon you no hardship in the religion—the way of your forefather Abraham. ˹It is Allah˺ Who named you ‘the ones who submit’ ˹in the˺ earlier ˹Scriptures˺ and in this ˹Quran˺, so that the Messenger may be a witness over you, and that you may be witnesses over humanity. So establish prayer, pay alms-tax, and hold fast to Allah. He ˹alone˺ is your Guardian. What an excellent Guardian, and what an excellent Helper!",
        "tr": "Allah uğrunda, hakkını vererek cihad edin. O, sizi seçti; din hususunda üzerinize hiçbir zorluk yüklemedi; babanız İbrahim'in dininde (de böyleydi). Daha önceki kitaplarda ve bu Kitapta, Peygamberin size şâhid olması, sizin de diğer insanlara şâhit olmanız için, sizi müslüman diye isimlendirmiştir. Bu itibarla namazı dosdoğru kılın; zekâtı verin ve Allah'a sımsıkı sarılın. O sizin mevlânızdır. O, ne güzel bir mevlâ ve ne güzel bir yardımcıdır."
      }
    },
    {
      "id": "24:37",
      "surah": "An-Nur",
      "verse": "24:37",
      "arabic": "رِجَالٌ ۙ لَّا تُلۡهِيۡهِمۡ تِجَارَةٌ وَّلَا بَيۡعٌ عَنۡ ذِكۡرِ اللّٰهِ وَاِقَامِ الصَّلٰوةِ وَ اِيۡتَآءِ الزَّكٰوةِ​ ۙ يَخَافُوۡنَ يَوۡمًا تَتَقَلَّبُ فِيۡهِ الۡقُلُوۡبُ وَالۡاَبۡصَارُ",
      "translation": {
        "en": "by men who are not distracted—either by buying or selling—from Allah’s remembrance, or performing prayer, or paying alms-tax. They fear a Day when hearts and eyes will tremble,",
        "tr": "Onlar, ne ticaret ne de alışverişin kendilerini Allah’ı anmaktan, namaz kılmaktan ve zekât vermekten alıkoyamadığı insanlardır. Onlar, kalplerin ve gözlerin allak bullak olduğu bir günden korkarlar."
      }
    },
    {
      "id": "27:3",
      "surah": "An-Naml",
      "verse": "27:3",
      "arabic": "الَّذِيۡنَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَيُؤۡتُوۡنَ الزَّكٰوةَ وَ هُمۡ بِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَ",
      "translation": {
        "en": "˹those˺ who establish prayer, pay alms-tax, and have sure faith in the Hereafter.",
        "tr": "Namazı kılan, zekâtı veren ve ahirete de kesin olarak inanırlar."
      }
    },
    {
      "id": "30:39",
      "surah": "Ar-Rum",
      "verse": "30:39",
      "arabic": "وَمَاۤ اٰتَيۡتُمۡ مِّنۡ رِّبًا لِّيَرۡبُوَا۟ فِىۡۤ اَمۡوَالِ النَّاسِ فَلَا يَرۡبُوۡا عِنۡدَ اللّٰهِ​ۚ وَمَاۤ اٰتَيۡتُمۡ مِّنۡ زَكٰوةٍ تُرِيۡدُوۡنَ وَجۡهَ اللّٰهِ فَاُولٰٓٮِٕكَ هُمُ الۡمُضۡعِفُوۡنَ",
      "translation": {
        "en": "Whatever loans you give, ˹only˺ seeking interest at the expense of people’s wealth will not increase with Allah. But whatever charity you give, ˹only˺ seeking the pleasure of Allah—it is they whose reward will be multiplied.",
        "tr": "İnsanların mallarında artış olsun diye verdiğiniz herhangi bir faiz, Allah katında artmaz. Allah’ın rızasını isteyerek verdiğiniz zekâta gelince, işte zekâtı veren o kimseler, evet onlar (sevaplarını ve mallarını) kat kat arttıranlardır."
      }
    },
    {
      "id": "31:4",
      "surah": "Luqman",
      "verse": "31:4",
      "arabic": "الَّذِيۡنَ يُقِيۡمُوۡنَ الصَّلٰوةَ وَيُؤۡتُوۡنَ الزَّكٰوةَ وَهُمۡ بِالۡاٰخِرَةِ هُمۡ يُوۡقِنُوۡنَؕ",
      "translation": {
        "en": "those who establish prayer, pay alms-tax, and have sure faith in the Hereafter.",
        "tr": "O kimseler, namazı dosdoğru kılarlar, zekâtı verirler, onlar ahirete de kesin olarak iman ederler."
      }
    },
    {
      "id": "33:33",
      "surah": "Al-Ahzab",
      "verse": "33:33",
      "arabic": "وَقَرۡنَ فِىۡ بُيُوۡتِكُنَّ وَلَا تَبَـرَّجۡنَ تَبَرُّجَ الۡجَاهِلِيَّةِ الۡاُوۡلٰى وَاَقِمۡنَ الصَّلٰوةَ وَاٰتِيۡنَ الزَّكٰوةَ وَاَطِعۡنَ اللّٰهَ وَرَسُوۡلَهٗ ؕ اِنَّمَا يُرِيۡدُ اللّٰهُ لِيُذۡهِبَ عَنۡكُمُ الرِّجۡسَ اَهۡلَ الۡبَيۡتِ وَيُطَهِّرَكُمۡ تَطۡهِيۡرًا ۚ",
      "translation": {
        "en": "Settle in your homes, and do not display yourselves as women did in the days of ˹pre-Islamic˺ ignorance. Establish prayer, pay alms-tax, and obey Allah and His Messenger. Allah only intends to keep ˹the causes of˺ evil away from you and purify you completely, O  members of the ˹Prophet’s˺ family!",
        "tr": "Evlerinizde oturun, eski cahiliye âdetinde olduğu gibi açılıp saçılmayın. Namazı dosdoğru kılın, zekâtı verin, Allah'a ve Rasûlüne itaat edin. Ey Ehli Beyt! Allah sizden, sadece günahı gidermek ve sizi tertemiz yapmak istiyor."
      }
    },
    {
      "id": "57:7",
      "surah": "Al-Hadid",
      "verse": "57:7",
      "arabic": "اٰمِنُوۡا بِاللّٰهِ وَرَسُوۡلِهٖ وَاَنۡفِقُوۡا مِمَّا جَعَلَـكُمۡ مُّسۡتَخۡلَفِيۡنَ فِيۡهِ​ؕ فَالَّذِيۡنَ اٰمَنُوۡا مِنۡكُمۡ وَاَنۡفَقُوۡا لَهُمۡ اَجۡرٌ كَبِيۡرٌ",
      "translation": {
        "en": "Believe in Allah and His Messenger, and donate from what He has entrusted you with. So those of you who believe and donate will have a mighty reward.",
        "tr": "Allah'a ve Rasûlü’ne iman edin. Sizi, üzerinde tasarrufa yetkili kıldığı şeylerden harcayın. Sizden iman edip de (Allah rızası için) harcayan kimselere büyük mükâfat vardır."
      }
    },
    {
      "id": "57:10",
      "surah": "Al-Hadid",
      "verse": "57:10",
      "arabic": "وَ مَا لَـكُمۡ اَلَّا تُنۡفِقُوۡا فِىۡ سَبِيۡلِ اللّٰهِ وَلِلّٰهِ مِيۡـرَاثُ السَّمٰوٰتِ وَ الۡاَرۡضِ​ؕ لَا يَسۡتَوِىۡ مِنۡكُمۡ مَّنۡ اَنۡفَقَ مِنۡ قَبۡلِ الۡفَتۡحِ وَقَاتَلَ​ ؕ اُولٰٓٮِٕكَ اَعۡظَمُ دَرَجَةً مِّنَ الَّذِيۡنَ اَنۡفَقُوۡا مِنۡۢ بَعۡدُ وَقَاتَلُوۡا​ ؕ وَكُلًّا وَّعَدَ اللّٰهُ الۡحُسۡنٰى​ؕ وَاللّٰهُ بِمَا تَعۡمَلُوۡنَ خَبِيۡرٌ",
      "translation": {
        "en": "And why should you not spend in the cause of Allah, while Allah is the ˹sole˺ inheritor of the heavens and the earth? Those of you who donated and fought before the victory ˹over Mecca˺ are unparalleled. They are far greater in rank than those who donated and fought afterwards. Yet Allah has promised each a fine reward. And Allah is All-Aware of what you do.",
        "tr": "Ne oluyor size ki, Allah yolunda harcamıyorsunuz? Halbuki göklerin ve yerin mirası Allah’ındır. Elbette içinizden, fetihten önce harcayan ve savaşanlar, daha sonra harcayıp savaşanlarla eşit değildir. Onların derecesi, sonradan infak eden ve savaşanlardan daha yüksektir. Bununla beraber Allah hepsine de en güzel olanı vâdetmiştir. Allah'ın yaptıklarınızdan hakkıyla haberdardır."
      }
    },
    {
      "id": "57:11",
      "surah": "Al-Hadid",
      "verse": "57:11",
      "arabic": "مَنۡ ذَا الَّذِىۡ يُقۡرِضُ اللّٰهَ قَرۡضًا حَسَنًا فَيُضٰعِفَهٗ لَهٗ وَلَهٗۤ اَجۡرٌ كَرِيۡمٌ ۚ",
      "translation": {
        "en": "Who is it that will lend to Allah a good loan which Allah will multiply ˹many times over˺ for them, and they will have an honourable reward?",
        "tr": "Kim Allah'a güzel bir ödünç verecek olursa, Allah da onun karşılığını kat kat verir ve ayrıca onun çok değerli bir mükâfatı da vardır."
      }
    },
    {
      "id": "57:18",
      "surah": "Al-Hadid",
      "verse": "57:18",
      "arabic": "اِنَّ الۡمُصَّدِّقِيۡنَ وَالۡمُصَّدِّقٰتِ وَاَقۡرَضُوا اللّٰهَ قَرۡضًا حَسَنًا يُّضٰعَفُ لَهُمۡ وَلَهُمۡ اَجۡرٌ كَرِيۡمٌ",
      "translation": {
        "en": "Indeed, those men and women who give in charity and lend to Allah a good loan will have it multiplied for them, and they will have an honourable reward.",
        "tr": "Sadaka veren erkeklere ve sadaka veren kadınlara ve Allah'a güzel bir ödünç verenlere, verdiklerinin karşılığı kat kat ödenir ve onlara değerli bir mükâfat vardır."
      }
    },
    {
      "id": "58:12",
      "surah": "Al-Mujadila",
      "verse": "58:12",
      "arabic": "يٰۤاَيُّهَا الَّذِيۡنَ اٰمَنُوۡۤا اِذَا نَاجَيۡتُمُ الرَّسُوۡلَ فَقَدِّمُوۡا بَيۡنَ يَدَىۡ نَجۡوٰٮكُمۡ صَدَقَةً  ​ؕ ذٰ لِكَ خَيۡرٌ لَّكُمۡ وَاَطۡهَرُ ​ؕ فَاِنۡ لَّمۡ تَجِدُوۡا فَاِنَّ اللّٰهَ غَفُوۡرٌ رَّحِيۡمٌ",
      "translation": {
        "en": "O believers! When you consult the Messenger privately, give something in charity before your consultation. That is better and purer for you. But if you lack the means, then Allah is truly All-Forgiving, Most Merciful.",
        "tr": "Ey iman edenler! Peygamber ile gizli bir şey konuşacağınız zaman bu konuşmanızdan önce bir sadaka veriniz. Bu sizin için daha hayırlı ve daha temizdir. Şayet bir şey bulamazsanız, bilin ki Allah bağışlayandır, esirgeyendir."
      }
    },
    {
      "id": "63:10",
      "surah": "Al-Munafiqun",
      "verse": "63:10",
      "arabic": "وَاَنۡفِقُوۡا مِنۡ مَّا رَزَقۡنٰكُمۡ مِّنۡ قَبۡلِ اَنۡ يَّاۡتِىَ اَحَدَكُمُ الۡمَوۡتُ فَيَقُوۡلَ رَبِّ لَوۡلَاۤ اَخَّرۡتَنِىۡۤ اِلٰٓى اَجَلٍ قَرِيۡبٍۙ فَاَصَّدَّقَ وَاَكُنۡ مِّنَ الصّٰلِحِيۡنَ",
      "translation": {
        "en": "And donate from what We have provided for you before death comes to one of you, and you cry, “My Lord! If only You delayed me for a short while, I would give in charity and be one of the righteous.”",
        "tr": "Herhangi birinize ölüm gelip de: Rabbim! Beni yakın bir süreye kadar geciktirsen de sadaka verip iyilerden olsam! demesinden önce, size verdiğimiz rızıktan harcayın."
      }
    },
    {
      "id": "64:16",
      "surah": "At-Taghabun",
      "verse": "64:16",
      "arabic": "فَاتَّقُوا اللّٰهَ مَا اسۡتَطَعۡتُمۡ وَاسۡمَعُوۡا وَاَطِيۡعُوۡا وَاَنۡفِقُوۡا خَيۡرًا لِّاَنۡفُسِكُمۡ​ؕ وَمَنۡ يُّوۡقَ شُحَّ نَفۡسِهٖ فَاُولٰٓٮِٕكَ هُمُ الۡمُفۡلِحُوۡنَ",
      "translation": {
        "en": "So be mindful of Allah to the best of your ability, hear and obey, and spend in charity—that will be best for you. And whoever is saved from the selfishness of their own souls, it is they who are ˹truly˺ successful.",
        "tr": "O halde gücünüz yettiğince Allah'a isyandan kaçının. Dinleyin, itaat edin, kendi iyiliğinize olarak harcayın. Kim nefsinin cimriliğinden korunursa işte onlar kurtuluşa erenlerdir."
      }
    },
    {
      "id": "74:6",
      "surah": "Al-Muddaththir",
      "verse": "74:6",
      "arabic": "وَلَا تَمۡنُنۡ تَسۡتَكۡثِرُ",
      "translation": {
        "en": "Do not do a favour expecting more ˹in return˺.",
        "tr": "Yaptığın iyiliği çok görerek başa kakma."
      }
    },
    {
      "id": "98:5",
      "surah": "Al-Bayyinah",
      "verse": "98:5",
      "arabic": "وَمَاۤ اُمِرُوۡۤا اِلَّا لِيَعۡبُدُوا اللّٰهَ مُخۡلِصِيۡنَ لَـهُ الدِّيۡنَۙ  حُنَفَآءَ وَيُقِيۡمُوا الصَّلٰوةَ وَيُؤۡتُوا الزَّكٰوةَ وَذٰلِكَ دِيۡنُ الۡقَيِّمَةِ ؕ",
      "translation": {
        "en": "even though they were only commanded to worship Allah ˹alone˺ with sincere devotion to Him in all uprightness, establish prayer, and pay alms-tax. That is the upright Way.",
        "tr": "Halbuki onlara ancak, dini yalnız O'na has kılarak ve hanifler olarak Allah'a kulluk etmeleri, namazı dosdoğru kılmaları ve zekât vermeleri emrolunmuştu. Sağlam din de budur."
      }
    }
  ],
  "hadiths": [
    {
      "id": "bukhari-2989",
      "number": 1,
      "arabic": "حَدَّثَنِي إِسْحَاقُ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم   كُلُّ سُلاَمَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ، يَعْدِلُ بَيْنَ الاِثْنَيْنِ صَدَقَةٌ، وَيُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ، فَيَحْمِلُ عَلَيْهَا، أَوْ يَرْفَعُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَكُلُّ خَطْوَةٍ يَخْطُوهَا إِلَى الصَّلاَةِ صَدَقَةٌ، وَيُمِيطُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ .",
      "source": "Sahih al-Bukhari 2989, Sahih Muslim 1009",
      "translation": {
        "en": "There is a (compulsory) Sadaqa (charity) to be given for every joint of the human body (as a sign of gratitude to Allah) everyday the sun rises. To judge justly between two persons is regarded as Sadaqa, and to help a man concerning his riding animal by helping him to ride it or by lifting his luggage on to it, is also regarded as Sadaqa, and (saying) a good word is also Sadaqa, and every step taken on one's way to offer the compulsory prayer (in the mosque) is also Sadaqa and to remove a harmful thing from the way is also Sadaqa.",
        "tr": "İnsan vücudundaki her ekleme, her gün güneş doğduğunda (Allah'a şükretme işareti olarak) sadaka vermek vardır. İki kişi arasında adaletli hükmetmek sadaka sayılır, bir adamın binek hayvanına binmesine veya eşyasını üzerine yüklemesine yardım etmek de sadaka sayılır, güzel söz söylemek de sadakadır, mescide farz namazı kılmaya giderken atılan her adım da sadakadır ve yoldan zararlı bir şeyi kaldırmak da sadakadır."
      }
    },
    {
      "id": "muslim-2588",
      "number": 3,
      "arabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ   مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلاَّ عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلاَّ رَفَعَهُ اللَّهُ  .",
      "source": "Sahih Muslim 2588",
      "translation": {
        "en": "Charity does not decrease wealth, no one forgives another except that Allah increases his honor, and no one humbles himself for the sake of Allah except that Allah raises his status.",
        "tr": "Sadaka, malı eksiltmez; kim birini affederse Allah onun şerefini artırır, kim Allah için alçakgönüllülük gösterirse Allah onun derecesini yükseltir."
      }
    },
    {
      "id": "muslim-1631",
      "number": 4,
      "arabic": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، - يَعْنِي ابْنَ سَعِيدٍ - وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - هُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ   إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلاَّ مِنْ ثَلاَثَةٍ إِلاَّ مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ  .",
      "source": "Sahih Muslim 1631",
      "translation": {
        "en": "When a man dies, his acts come to an end, but three, recurring charity, or knowledge (by which people) benefit, or a pious child, who prays for him (for the deceased).",
        "tr": "Bir insan öldüğünde amelleri kesilir, ancak üç şey hariç: Sadaka-i cariye (devam eden sadaka), insanların faydalandığı ilim veya kendisi için dua eden salih evlat."
      }
    },
    {
      "id": "mishkat-1925",
      "number": 5,
      "arabic": "وَعَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ قَالَ: حَدَّثَنِي بَعْضِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ ظِلَّ الْمُؤْمِنِ يَوْمَ الْقِيَامَة صدقته» . رَوَاهُ أَحْمد",
      "source": "Mishkat al-Masabih 1925",
      "translation": {
        "en": "The believer's shade on the day of resurrection will be his sadaqa.",
        "tr": "Müminin kıyamet günündeki gölgesi, sadakası olacaktır."
      }
    },
    {
      "id": "bukhari-1417",
      "number": 6,
      "arabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَعْقِلٍ، قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ ـ رضى الله عنه ـ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ   اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ .",
      "source": "Sahih al-Bukhari 1417, Sahih Muslim 1016",
      "translation": {
        "en": "Save yourself from Hell-fire even by giving half a date-fruit in charity.",
        "tr": "Kendinizi Cehennem ateşinden, yarım hurma bile olsa sadaka vererek koruyun."
      }
    },
    {
      "id": "bukhari-4684",
      "number": 7,
      "arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" قَالَ اللَّهُ عَزَّ وَجَلَّ أَنْفِقْ أُنْفِقْ عَلَيْكَ ـ وَقَالَ ـ يَدُ اللَّهِ مَلأَى لاَ تَغِيضُهَا نَفَقَةٌ، سَحَّاءُ اللَّيْلَ وَالنَّهَارَ ـ وَقَالَ ـ أَرَأَيْتُمْ مَا أَنْفَقَ مُنْذُ خَلَقَ السَّمَاءَ وَالأَرْضَ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَدِهِ، وَكَانَ عَرْشُهُ عَلَى الْمَاءِ، وَبِيَدِهِ الْمِيزَانُ يَخْفِضُ وَيَرْفَعُ \". {اعْتَرَاكَ} افْتَعَلْتَ مِنْ عَرَوْتُهُ أَىْ أَصَبْتُهُ، وَمِنْهُ يَعْرُوهُ وَاعْتَرَانِي {آخِذٌ بِنَاصِيَتِهَا} أَىْ فِي مِلْكِهِ وَسُلْطَانِهِ. عَنِيدٌ وَعَنُودٌ وَعَانِدٌ وَاحِدٌ، هُوَ تَأْكِيدُ التَّجَبُّرِ، {اسْتَعْمَرَكُمْ} جَعَلَكُمْ عُمَّارًا، أَعْمَرْتُهُ الدَّارَ فَهْىَ عُمْرَى جَعَلْتُهَا لَهُ. {نَكِرَهُمْ} وَأَنْكَرَهُمْ وَاسْتَنْكَرَهُمْ وَاحِدٌ {حَمِيدٌ مَجِيدٌ} كَأَنَّهُ فَعِيلٌ مِنْ مَاجِدٍ. مَحْمُودٌ مِنْ حَمِدَ. سِجِّيلٌ الشَّدِيدُ الْكَبِيرُ. سِجِّيلٌ وَسِجِّينٌ وَاللاَّمُ وَالنُّونُ أُخْتَانِ، وَقَالَ تَمِيمُ بْنُ مُقْبِلٍ وَرَجْلَةٍ يَضْرِبُونَ الْبَيْضَ ضَاحِيَةً ضَرْبًا تَوَاصَى بِهِ الأَبْطَالُ سِجِّينَا",
      "source": "Sahih al-Bukhari 4684, Sahih Muslim 993",
      "translation": {
        "en": "Allah said, 'Spend (O man), and I shall spend on you. He also said, Allah's Hand is full, and (its fullness) is not affected by the continuous spending night and day. He also said, Do you see what He has spent since He created the Heavens and the Earth? Nevertheless, what is in His Hand is not decreased, and His Throne was over the water; and in His Hand there is the balance (of justice) whereby He raises and lowers (people).",
        "tr": "Allah buyurdu ki: 'Harcayın (ey insan), ben de sizin üzerinize harcayacağım.' Ayrıca buyurdu ki: Allah'ın eli doludur, gece ve gündüz durmadan harcanması onun doluluğunu eksiltmez. Yine buyurdu ki: Gökleri ve yeri yarattığından beri harcadıklarını görmüyor musunuz? Yine de O'nun elindekiler eksilmemiştir, Arş'ı su üzerindeydi; elinde adalet terazisi vardır, onunla kimi yükseltir kimi alçaltır."
      }
    },
    {
      "id": "muslim-2578",
      "number": 8,
      "arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا دَاوُدُ، - يَعْنِي ابْنَ قَيْسٍ - عَنْ عُبَيْدِ، اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ   اتَّقُوا الظُّلْمَ فَإِنَّ الظُّلْمَ ظُلُمَاتٌ يَوْمَ الْقِيَامَةِ وَاتَّقُوا الشُّحَّ فَإِنَّ الشُّحَّ أَهْلَكَ مَنْ كَانَ قَبْلَكُمْ حَمَلَهُمْ عَلَى أَنْ سَفَكُوا دِمَاءَهُمْ وَاسْتَحَلُّوا مَحَارِمَهُمْ  .",
      "source": "Sahih Muslim 2578",
      "translation": {
        "en": "Be on your guard against committing oppression, for oppression is a darkness on the Day of Resurrection, and be on your guard against stinginess for stinginess destroyed those who were before you, as it incited them to shed blood and make lawful what was unlawful for them.",
        "tr": "Zulümden sakının, çünkü zulüm kıyamet gününde karanlıktır; cimrilikten de sakının, çünkü cimrilik sizden öncekileri helak etti, onları kan dökmeye ve kendileri için haram olan şeyleri helal kılmaya sevk etti."
      }
    },
    {
      "id": "ibn-majah-3684",
      "number": 9,
      "arabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ عُبَادَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ   سَقْىُ الْمَاءِ  .",
      "source": "Sunan Ibn Majah 3684 (Hasan)",
      "translation": {
        "en": "It was narrated that Sad bin Ubadah said: I said: 'O Messenger of Allah, what charity is best?' He said: 'Giving water to drink.'",
        "tr": "Sad bin Ubade anlattı ki: Dedim ki: 'Ey Allah'ın Rasûlü, hangi sadaka en faziletlidir?' Dedi ki: 'Su içirmek.'"
      }
    },
    {
      "id": "tirmidhi-1962",
      "number": 11,
      "arabic": "حَدَّثَنَا أَبُو حَفْصٍ، عَمْرُو بْنُ عَلِيٍّ أَخْبَرَنَا أَبُو دَاوُدَ، حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى، حَدَّثَنَا مَالِكُ بْنُ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ غَالِبٍ الْحُدَّانِيُّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم   خَصْلَتَانِ لاَ تَجْتَمِعَانِ فِي مُؤْمِنٍ الْبُخْلُ وَسُوءُ الْخُلُقِ  . قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لاَ نَعْرِفُهُ إِلاَّ مِنْ حَدِيثِ صَدَقَةَ بْنِ مُوسَى . وَفِي الْبَابِ عَنْ أَبِي هُرَيْرَةَ .",
      "source": "Sunan al-Tirmidhi 1962 (Sahih)",
      "translation": {
        "en": "Two traits are not combined in a believer: Stinginess and bad manners.",
        "tr": "İki haslet müminde bir arada bulunmaz: Cimrilik ve kötü huyluluk."
      }
    },
    {
      "id": "muslim-1005",
      "number": 13,
      "arabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، كِلاَهُمَا عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، فِي حَدِيثِ قُتَيْبَةَ قَالَ قَالَ نَبِيُّكُمْ صلى الله عليه وسلم وَقَالَ ابْنُ أَبِي شَيْبَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ   كُلُّ مَعْرُوفٍ صَدَقَةٌ  .",
      "source": "Sahih Muslim 1005",
      "translation": {
        "en": "Every act of goodness is sadaqa.",
        "tr": "Her iyilik sadakadır."
      }
    },
    {
      "id": "tirmidhi-1956",
      "number": 14,
      "arabic": "حَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ الْجُرَشِيُّ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا أَبُو زُمَيْلٍ، عَنْ مَالِكِ بْنِ مَرْثَدٍ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم   تَبَسُّمُكَ فِي وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ وَأَمْرُكَ بِالْمَعْرُوفِ وَنَهْيُكَ عَنِ الْمُنْكَرِ صَدَقَةٌ وَإِرْشَادُكَ الرَّجُلَ فِي أَرْضِ الضَّلاَلِ لَكَ صَدَقَةٌ وَبَصَرُكَ لِلرَّجُلِ الرَّدِيءِ الْبَصَرِ لَكَ صَدَقَةٌ وَإِمَاطَتُكَ الْحَجَرَ وَالشَّوْكَةَ وَالْعَظْمَ عَنِ الطَّرِيقِ لَكَ صَدَقَةٌ وَإِفْرَاغُكَ مِنْ دَلْوِكَ فِي دَلْوِ أَخِيكَ لَكَ صَدَقَةٌ  . قَالَ وَفِي الْبَابِ عَنِ ابْنِ مَسْعُودٍ وَجَابِرٍ وَحُذَيْفَةَ وَعَائِشَةَ وَأَبِي هُرَيْرَةَ . قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ . وَأَبُو زُمَيْلٍ اسْمُهُ سِمَاكُ بْنُ الْوَلِيدِ الْحَنَفِيُّ .",
      "source": "Sunan al-Tirmidhi 1956 (Hasan)",
      "translation": {
        "en": "Your smiling in the face of your brother is charity, commanding good and forbidding evil is charity, your giving directions to a man lost in the land is charity for you. Your seeing for a man with bad sight is a charity for you, your removal of a rock, a thorn or a bone from the road is charity for you. Your pouring what remains from your bucket into the bucket of your brother is charity for you.",
        "tr": "Kardeşinin yüzüne tebessüm etmek sana sadakadır, iyiliği emretmek ve kötülükten men etmek sadakadır, yolda kaybolmuş bir adama yol göstermek sana sadakadır. Gözü zayıf bir adam için gözünüzle görmek sana sadakadır, yoldan bir taş, diken veya kemiği kaldırmak sana sadakadır. Kovandan artan suyu kardeşinin kovasına boşaltmak sana sadakadır."
      }
    },
    {
      "id": "bukhari-1423",
      "number": 19,
      "arabic": "حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا يَحْيَى، عَنْ عُبَيْدِ اللَّهِ، قَالَ حَدَّثَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ   سَبْعَةٌ يُظِلُّهُمُ اللَّهُ تَعَالَى فِي ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَدْلٌ، وَشَابٌّ نَشَأَ فِي عِبَادَةِ اللَّهِ، وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسَاجِدِ، وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ اجْتَمَعَا عَلَيْهِ وَتَفَرَّقَا عَلَيْهِ، وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّي أَخَافُ اللَّهَ، وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ، وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ .",
      "source": "Sahih al-Bukhari 1423, Sahih Muslim 1031",
      "translation": {
        "en": "Seven people will be shaded by Allah under His shade on the day when there will be no shade except His. They are: (1) a just ruler; (2) a young man who has been brought up in the worship of Allah, (i.e. worship Allah (Alone) sincerely from his childhood), (3) a man whose heart is attached to the mosque (who offers the five compulsory congregational prayers in the mosque); (4) two persons who love each other only for Allah's sake and they meet and part in Allah's cause only; (5) a man who refuses the call of a charming woman of noble birth for an illegal sexual intercourse with her and says: I am afraid of Allah; (6) a person who practices charity so secretly that his left hand does not know what his right hand has given (i.e. nobody knows how much he has given in charity). (7) a person who remembers Allah in seclusion and his eyes get flooded with tears.",
        "tr": "Kıyamet gününde gölgelikten başka gölge olmayacağı zaman, Allah yedi kişiyi kendi gölgesinde gölgelendirecektir. Bunlar: (1) Adaletli bir devlet başkanı; (2) Allah'ın ibadeti içinde büyütülen bir genç; (3) Kalbi mescidlere bağlı olan kimse (mescidde beş vakit farz namazı kılan kimse); (4) Yalnızca Allah rızası için birbirlerini seven, yalnızca Allah yolunda bir araya gelen ve ayrılan iki kişi; (5) Soylu ve güzel bir kadının zinası teklifini reddeden ve 'Ben Allah'tan korkarım' diyen kimse; (6) Sadakasını öyle gizli yapan kişi ki sol eli sağ elinin ne verdiğini bilmez (yani kimse ne kadar sadaka verdiğini bilmez); (7) Yalnız başına Allah'ı anarken gözleri yaşla dolan kişi."
      }
    },
    {
      "id": "bukhari-1",
      "number": 18,
      "arabic": "حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ ، قَالَ: حَدَّثَنَا سُفْيَانُ ، قَالَ: حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ ، قَالَ: أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ ، يَقُولُ: سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَلَى الْمِنْبَرِ، قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ:  إِنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ",
      "source": "Sahih al-Bukhari 1, Sahih Muslim 1907",
      "note": "This hadith emphasizes the importance of sincere intention when giving charity.",
      "translation": {
        "en": "The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.",
        "tr": "Ameller niyetlere göredir ve her insan niyet ettiğine göre mükâfatını alır. Kim dünyalık bir menfaat için veya evleneceği bir kadın için hicret ederse, hicreti o niyet ettiği şeye göredir."
      }
    }
  ]
}
